[{"Name":"Kathmandu BernHardt College","Address":"Bafal, Kathmandu,  Nepal","Contact":"+977-1-5237330/5237361","Website":"https://www.kbc.edu.np","Email":"ktmbernhardt@kbc.edu.np","Intro":"BernHardt is a unique institution designed to disseminate quality education within the quality framework. BernHardt aims to help all students make the most of themselves in terms of academic and social perspective. Many students who have been trained within its walls have been leading their successful lives in different walks of life. BernHardt caters bachelor's level of program on BSc. CSIT With the noble motto of the college 'ad astra per aspera'(L) (to the stars by hard ways), we keep on telling our students: Facing it, always facing it - that's the way to get through. Face it. BernHardt has embraced dedicated professionals from different walks of life. The college feels pride to have accommodated outstanding personalities in its management body with minimum experiences of not less than a decade in the feld of academic institutions with extensive exposure to knowledge and teaching practice- nationally as well as internationally. Determined to play a leading part in the development of modern higher education on science and technology, the members of management board lay particular emphasis on their relationships with public bodies and with other educational institutions. ","Vision":"The vision of KBC has evolved over the years since its inception in 2003. The vision of KBC is to develop the center of excellence for Management, Social Sciences, Technical and Professional education and Research at par with national and international standard, advancing the nation’s interest to fulfill gaps of skilled professional as well as to compete successfully in the global arena.This vision stands today as the underpinning and conceptual framework for the strategies and initiatives outlined in the plan that follows. It also reflects the values and aspirations of a broad cross section of the college","Mission":"The Mission of KBC is toestablish it as world class learning center that equip students with the skills, ability and knowledge to successfully compete in their chosen discipline."}]

